In [1]:
# query() 메소드를 적용하면, 문자열 표현을 사용하여 간편하게 필터링을 수행할 수있음

In [5]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')

# 행 인덱스 0 ~ 9 범위에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
df = titanic.loc[0:9, ['age','fare']]

df

df.query('age < 20')

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [12]:
df.query('age >= 20 and fare < 15')

    age     fare
0  22.0   7.2500
2  26.0   7.9250
4  35.0   8.0500
8  27.0  11.1333

In [20]:
df.query('age >= 20 and fare < 15')

    age     fare
0  22.0   7.2500
2  26.0   7.9250
4  35.0   8.0500
8  27.0  11.1333

In [22]:
df.query('age >= 20 or fare < 15')

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
8  27.0  11.1333